In [ ]:
#27-12-2021

In [10]:
import pandas as pd#pandas is used to load data file in program

In [2]:
x=10

In [4]:
print(x)

10

In [13]:
data1=pd.read_excel(r'C:\Users\\youra\OneDrive\\Desktop\DataTrained\27-28nov\My_data1.xlsx')

In [14]:
data1

    Name  Age   Salary
0  Pinky    30   20000
1   John    22   15000
2   Neha    25   30000
3    Raj    26   35000

In [15]:
data2=pd.read_csv(r'C:\Users\youra\OneDrive\Desktop\DataTrained\27-28nov\My_dat2.csv')

In [16]:
data2

   RollNo     Name  Batch
0    1001   Pinky    1840
1    1002     John   1843
2    1003   Deepak   1840
3    1004  Anjuman   1765

In [17]:
data3=pd.read_csv(r'C:\Users\youra\OneDrive\Desktop\DataTrained\27-28nov\My_Dat3.tsv')

In [18]:
data3

  RollNo\tName\tBatch
0   1001\tPinky\t1840
1    1002\tJohn\t1765
2    1003\tNeha\t1345
3     1004\tRaj\t1540

In [19]:
data3=pd.read_csv(r'C:\Users\youra\OneDrive\Desktop\DataTrained\27-28nov\My_Dat3.tsv',sep='\t')

In [20]:
data3

   RollNo   Name  Batch
0    1001  Pinky   1840
1    1002   John   1765
2    1003   Neha   1345
3    1004    Raj   1540